---
kind: property
id: P:Autodesk.Revit.DB.PlanTopology.Circuits
source: html/42b88afe-69fe-4e8a-4bc2-63f84c63ea64.htm
---
# Autodesk.Revit.DB.PlanTopology.Circuits Property

The Circuits of the PlanTopology.

## Syntax (C#)
```csharp
public PlanCircuitSet Circuits { get; }
```